yifeian/stm32_project/User/BSP/en28j60/bsp_enc28j60.h
#ifndef __BSP_ENC28J60_H
#define __BSP_ENC28J60_H

#include "stm32f4xx.h"
#include <stdio.h>
#include "bsp_spi_flash.h"



/*SPI接口定义-开头****************************/
#define NETWORK_SPI                           SPI1
#define NETWORK_SPI_CLK                       RCC_APB2Periph_SPI1
#define NETWORK_SPI_CLK_INIT                  RCC_APB2PeriphClockCmd

#define NETWORK_SPI_SCK_PIN                   GPIO_Pin_3                 
#define NETWORK_SPI_SCK_GPIO_PORT             GPIOB                       
#define NETWORK_SPI_SCK_GPIO_CLK              RCC_AHB1Periph_GPIOB
#define NETWORK_SPI_SCK_PINSOURCE             GPIO_PinSource3
#define NETWORK_SPI_SCK_AF                    GPIO_AF_SPI1

#define NETWORK_SPI_MISO_PIN                  GPIO_Pin_4               
#define NETWORK_SPI_MISO_GPIO_PORT            GPIOB                
#define NETWORK_SPI_MISO_GPIO_CLK             RCC_AHB1Periph_GPIOB
#define NETWORK_SPI_MISO_PINSOURCE            GPIO_PinSource4
#define NETWORK_SPI_MISO_AF                   GPIO_AF_SPI1

#define NETWORK_SPI_MOSI_PIN                  GPIO_Pin_5                
#define NETWORK_SPI_MOSI_GPIO_PORT            GPIOB                    
#define NETWORK_SPI_MOSI_GPIO_CLK             RCC_AHB1Periph_GPIOB
#define NETWORK_SPI_MOSI_PINSOURCE            GPIO_PinSource5
#define NETWORK_SPI_MOSI_AF                   GPIO_AF_SPI1

#define NETWORK_CS_PIN                        GPIO_Pin_15              
#define NETWORK_CS_GPIO_PORT                  GPIOA                     
#define NETWORK_CS_GPIO_CLK                   RCC_AHB1Periph_GPIOA

#define NETWORK_RST_PIN                       GPIO_Pin_11               
#define NETWORK_ENC28J60_RST                  GPIOA                     
#define NETWORK_RST_GPIO_CLK                  RCC_AHB1Periph_GPIOA

#define NETWORK_INT_PIN                       GPIO_Pin_12               
#define NETWORK_ENC28J60_INT                  GPIOA                     
#define NETWORK_INT_GPIO_CLK                  RCC_AHB1Periph_GPIOA


#define ENC28J60_CS(a)	if (a)	\
							GPIO_SetBits(NETWORK_CS_GPIO_PORT,NETWORK_CS_PIN);\
						else		\
							GPIO_ResetBits(NETWORK_CS_GPIO_PORT,NETWORK_CS_PIN)
#define ENC28J60_RST(a)	if (a)	\
							GPIO_SetBits(NETWORK_ENC28J60_RST,NETWORK_RST_PIN);\
						else		\
							GPIO_ResetBits(NETWORK_ENC28J60_RST,NETWORK_RST_PIN)
							
#define ENC28J60_INT	    GPIO_ReadInputDataBit(NETWORK_ENC28J60_INT,NETWORK_INT_PIN)


/*SPI接口定义-结尾****************************/



/*信息输出*/
#define NETWORK_DEBUG_ON         1

#define NETWORK_INFO(fmt,arg...)           printf("<<-NETWORK-INFO->> "fmt"\n",##arg)
#define NETWORK_ERROR(fmt,arg...)          printf("<<-NETWORK-ERROR->> "fmt"\n",##arg)
#define NETWORK_DEBUG(fmt,arg...)          do{\
                                          if(NETWORK_DEBUG_ON)\
                                          printf("<<-NETWORK-DEBUG->> [%d]"fmt"\n",__LINE__, ##arg);\
                                          }while(0)
                                          
#define ADDR_MASK	0X1F
#define BANK_MASK	0X60
#define SPRD_MASK	0X80
										  
										  //所有Bank共有的寄存器
#define EIE              0x1B
#define EIR              0x1C
#define ESTAT            0x1D
#define ECON2            0x1E
#define ECON1            0x1F
										  
										  //Bank 0寄存器
#define ERDPTL           (0x00|0x00)
#define ERDPTH           (0x01|0x00)
#define EWRPTL           (0x02|0x00)
#define EWRPTH           (0x03|0x00)
#define ETXSTL           (0x04|0x00)
#define ETXSTH           (0x05|0x00)
#define ETXNDL           (0x06|0x00)
#define ETXNDH           (0x07|0x00)
#define ERXSTL           (0x08|0x00)
#define ERXSTH           (0x09|0x00)
#define ERXNDL           (0x0A|0x00)
#define ERXNDH           (0x0B|0x00)
										  //ERXWRPTH:ERXWRPTL 寄存器定义硬件向FIFO 中
										  //的哪个位置写入其接收到的字节。 指针是只读的，在成
										  //功接收到一个数据包后，硬件会自动更新指针。 指针可
										  //用于判断FIFO 内剩余空间的大小。
#define ERXRDPTL         (0x0C|0x00)
#define ERXRDPTH         (0x0D|0x00)
#define ERXWRPTL         (0x0E|0x00)
#define ERXWRPTH         (0x0F|0x00)
#define EDMASTL          (0x10|0x00)
#define EDMASTH          (0x11|0x00)
#define EDMANDL          (0x12|0x00)
#define EDMANDH          (0x13|0x00)
#define EDMADSTL         (0x14|0x00)
#define EDMADSTH         (0x15|0x00)
#define EDMACSL          (0x16|0x00)
#define EDMACSH          (0x17|0x00)
										  
										  //Bank 1寄存器
#define EHT0             (0x00|0x20)
#define EHT1             (0x01|0x20)
#define EHT2             (0x02|0x20)
#define EHT3             (0x03|0x20)
#define EHT4             (0x04|0x20)
#define EHT5             (0x05|0x20)
#define EHT6             (0x06|0x20)
#define EHT7             (0x07|0x20)
#define EPMM0            (0x08|0x20)
#define EPMM1            (0x09|0x20)
#define EPMM2            (0x0A|0x20)
#define EPMM3            (0x0B|0x20)
#define EPMM4            (0x0C|0x20)
#define EPMM5            (0x0D|0x20)
#define EPMM6            (0x0E|0x20)
#define EPMM7            (0x0F|0x20)
#define EPMCSL           (0x10|0x20)
#define EPMCSH           (0x11|0x20)
#define EPMOL            (0x14|0x20)
#define EPMOH            (0x15|0x20)
#define EWOLIE           (0x16|0x20)
#define EWOLIR           (0x17|0x20)
#define ERXFCON          (0x18|0x20)
#define EPKTCNT          (0x19|0x20)
										  
										  //Bank 2寄存器
#define MACON1           (0x00|0x40|0x80)
#define MACON2           (0x01|0x40|0x80)
#define MACON3           (0x02|0x40|0x80)
#define MACON4           (0x03|0x40|0x80)
#define MABBIPG          (0x04|0x40|0x80)
#define MAIPGL           (0x06|0x40|0x80)
#define MAIPGH           (0x07|0x40|0x80)
#define MACLCON1         (0x08|0x40|0x80)
#define MACLCON2         (0x09|0x40|0x80)
#define MAMXFLL          (0x0A|0x40|0x80)
#define MAMXFLH          (0x0B|0x40|0x80)
#define MAPHSUP          (0x0D|0x40|0x80)
#define MICON            (0x11|0x40|0x80)
#define MICMD            (0x12|0x40|0x80)
#define MIREGADR         (0x14|0x40|0x80)
#define MIWRL            (0x16|0x40|0x80)
#define MIWRH            (0x17|0x40|0x80)
#define MIRDL            (0x18|0x40|0x80)
#define MIRDH            (0x19|0x40|0x80)
										  
										  //Bank 3 寄存器
#define MAADR1           (0x00|0x60|0x80)
#define MAADR0           (0x01|0x60|0x80)
#define MAADR3           (0x02|0x60|0x80)
#define MAADR2           (0x03|0x60|0x80)
#define MAADR5           (0x04|0x60|0x80)
#define MAADR4           (0x05|0x60|0x80)
#define EBSTSD           (0x06|0x60)
#define EBSTCON          (0x07|0x60)
#define EBSTCSL          (0x08|0x60)
#define EBSTCSH          (0x09|0x60)
#define MISTAT           (0x0A|0x60|0x80)
#define EREVID           (0x12|0x60)
#define ECOCON           (0x15|0x60)
#define EFLOCON          (0x17|0x60)
#define EPAUSL           (0x18|0x60)
#define EPAUSH           (0x19|0x60)
										  
										  //PHY寄存器
#define PHCON1           0x00
#define PHSTAT1          0x01
#define PHHID1           0x02
#define PHHID2           0x03
#define PHCON2           0x10
#define PHSTAT2          0x11
#define PHIE             0x12
#define PHIR             0x13
#define PHLCON           0x14
										  
										  //ENC28J60 ERXFCON寄存器定义
#define ERXFCON_UCEN     0x80
#define ERXFCON_ANDOR    0x40
#define ERXFCON_CRCEN    0x20
#define ERXFCON_PMEN     0x10
#define ERXFCON_MPEN     0x08
#define ERXFCON_HTEN     0x04
#define ERXFCON_MCEN     0x02
#define ERXFCON_BCEN     0x01
										  //ENC28J60 EIE寄存器位定义
#define EIE_INTIE        0x80
#define EIE_PKTIE        0x40
#define EIE_DMAIE        0x20
#define EIE_LINKIE       0x10
#define EIE_TXIE         0x08
#define EIE_WOLIE        0x04
#define EIE_TXERIE       0x02
#define EIE_RXERIE       0x01
										  //ENC28J60 EIR寄存器位定义
#define EIR_PKTIF        0x40
#define EIR_DMAIF        0x20
#define EIR_LINKIF       0x10
#define EIR_TXIF         0x08
#define EIR_WOLIF        0x04
#define EIR_TXERIF       0x02
#define EIR_RXERIF       0x01
										  //ENC28J60 ESTAT寄存器位定义
#define ESTAT_INT        0x80
#define ESTAT_LATECOL    0x10
#define ESTAT_RXBUSY     0x04
#define ESTAT_TXABRT     0x02
#define ESTAT_CLKRDY     0x01
										  //NC28J60 ECON2寄存器位定义
#define ECON2_AUTOINC    0x80
#define ECON2_PKTDEC     0x40
#define ECON2_PWRSV      0x20
#define ECON2_VRPS       0x08
										  //NC28J60 ECON1寄存器位定义
#define ECON1_TXRST      0x80
#define ECON1_RXRST      0x40
#define ECON1_DMAST      0x20
#define ECON1_CSUMEN     0x10
#define ECON1_TXRTS      0x08
#define ECON1_RXEN       0x04
#define ECON1_BSEL1      0x02
#define ECON1_BSEL0      0x01
										  //ENC28J60 MACON1寄存器位定义
#define MACON1_LOOPBK    0x10
#define MACON1_TXPAUS    0x08
#define MACON1_RXPAUS    0x04
#define MACON1_PASSALL   0x02
#define MACON1_MARXEN    0x01
										  //ENC28J60 MACON2寄存器位定义
#define MACON2_MARST     0x80
#define MACON2_RNDRST    0x40
#define MACON2_MARXRST   0x08
#define MACON2_RFUNRST   0x04
#define MACON2_MATXRST   0x02
#define MACON2_TFUNRST   0x01
										  //ENC28J60 MACON3寄存器位定义
#define MACON3_PADCFG2   0x80
#define MACON3_PADCFG1   0x40
#define MACON3_PADCFG0   0x20
#define MACON3_TXCRCEN   0x10
#define MACON3_PHDRLEN   0x08
#define MACON3_HFRMEN   0x04
#define MACON3_FRMLNEN   0x02
#define MACON3_FULDPX    0x01
										  //ENC28J60 MICMD寄存器位定义
#define MICMD_MIISCAN    0x02
#define MICMD_MIIRD      0x01
										  //ENC28J60 MISTAT寄存器位定义
#define MISTAT_NVALID    0x04
#define MISTAT_SCAN      0x02
#define MISTAT_BUSY      0x01
										  //ENC28J60 PHY PHCON1寄存器位定义
#define PHCON1_PRST      0x8000
#define PHCON1_PLOOPBK   0x4000
#define PHCON1_PPWRSV    0x0800
#define PHCON1_PDPXMD    0x0100
										  //ENC28J60 PHY PHSTAT1寄存器位定义
#define PHSTAT1_PFDPX    0x1000
#define PHSTAT1_PHDPX    0x0800
#define PHSTAT1_LLSTAT   0x0004
#define PHSTAT1_JBSTAT   0x0002
										  //ENC28J60 PHY PHCON2寄存器位定义
#define PHCON2_FRCLINK   0x4000
#define PHCON2_TXDIS     0x2000
#define PHCON2_JABBER    0x0400
#define PHCON2_HDLDIS    0x0100
										  
										  //ENC28J60 Packet Control Byte Bit Definitions
#define PKTCTRL_PHUGEEN  0x08
#define PKTCTRL_PPADEN   0x04
#define PKTCTRL_PCRCEN   0x02
#define PKTCTRL_POVERRIDE 0x01
										  
										  //SPI运行代码
#define ENC28J60_READ_CTRL_REG       0x00
#define ENC28J60_READ_BUF_MEM        0x3A
#define ENC28J60_WRITE_CTRL_REG      0x40
#define ENC28J60_WRITE_BUF_MEM       0x7A
#define ENC28J60_BIT_FIELD_SET       0x80
#define ENC28J60_BIT_FIELD_CLR       0xA0
#define ENC28J60_SOFT_RESET          0xFF
										  
#define RXSTART_INIT 	0x0				//接收buffer起始位置必须为0	
#define RXSTOP_INIT  	(0x1FFF-1518-1)	//接收buffer终止位置
#define TXSTART_INIT  	(0x1FFF-1518)	//发送buffer的起始位置
#define TXSTOP_INIT     0x1FFF			//发送buffer的终止位置
#define MAX_FRAMELEN    1518        	//以太网最大帧长度
										  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
											
typedef struct{
  u8 enc28j60bank;	  //ENC28J60当前使用的控制寄存器块
  u32 NextPacketPtr;  //读指针
  u8 macaddr[6];	  //MAC地址
}dev_strucrt;

extern dev_strucrt enc28j60_dev;


u8 ENC28J60_Read_Op(u8 op,u8 addr);
void ENC28J60_Write_Op(u8 op,u8 addr,u8 data);
void ENC28J60_Set_Bank(u8 bank);
u8 ENC28J60_Get_EREVID(void);
u16 ENC28J60_Get_Duplex(void);
u8 ENC28J60_Read(u8 addr);
void ENC28J60_Write(u8 addr,u8 data);
void ENC28J60_PHY_Write(u8 addr,u16 data);
u16 ENC28J60_PHY_Read(u8 addr);
void ENC28J60_Packet_Send(u32 len,u8* packet);
u32 ENC28J60_Packet_Receive(u32 maxlen,u8* packet);




u8 SPI_NETWORK_Init(void);
u8 SPI_NETWORK_ReadByte(void);
u8 SPI_NETWORK_SendByte(u8 byte);


#endif /* __SPI_NETWORK_H */

